# ReverseIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetSet..::..ReverseIterator Method
AssetSet Class See Also
---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual AssetSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As AssetSetIterator
```

Visual C++
---
```text
public:
virtual AssetSetIterator^ ReverseIterator()
```

# See Also
AssetSet Class
Autodesk.Revit.DB.Visual Namespace